# Создать строку равную всем элементам введенной
# строки с четными индексами. (считая, что индексация
# начинается с 0, поэтому символы выводятся начиная c
# первого, индексы 0,2,4,6....).

a = input()

some_str = a[::2]

print(some_str)
