# Создать строку равную третьему символу введенной строки.

some_string = str(input())

third_symb = some_string[3]

print(third_symb)
