 # Создать строку равную предпоследнему символу введенной строки

a = str(input())

penult_symb = a[-2]

print(penult_symb)
