# Создать строку равную первым пяти символам введенной строки.

a = str(input())

five_symb = a[:5]

print(five_symb)
