# Создать строку равную введенной без последних двух символов.

a = input()

some_str = a[:-2]

print(some_str)
